stress.yaml
config:
  target: https://api.tracelabs.org
  phases:
    - duration: 300
      arrivalRate: 20 
  defaults:
    headers:
      Authorization: Bearer eyJ0eXAiOiJKV1QiLCJhbGciOiJSUzI1NiIsImtpZCI6Ik1FVkRSa05ETmpnelJqTTBSalV5UmpNd09VTTVOa1JCTjBNNVJEZEZNMFF6TjBNMU5qYzFOUSJ9.eyJodHRwczovL2N0Zi5zYWlnYXIuaW8vcm9sZXMiOnsiZ3JvdXBzIjpbImNvbnRlc3RhbnQiXX0sImh0dHBzOi8vaGFzdXJhLmlvL2p3dC9jbGFpbXMiOnsieC1oYXN1cmEtZGVmYXVsdC1yb2xlIjoiY29udGVzdGFudCIsIngtaGFzdXJhLWFsbG93ZWQtcm9sZXMiOlsiY3RmX2FkbWluIiwianVkZ2UiLCJjb250ZXN0YW50Il0sIngtaGFzdXJhLXVzZXItaWQiOiJhdXRoMHw1ZDkyOWQ2ODMyODU2ZDBjNThlOWJiODkifSwibmlja25hbWUiOiJwaW90ciIsIm5hbWUiOiJyb2NjbzU2QGdtYWlsLmNvbSIsInBpY3R1cmUiOiJodHRwczovL3MuZ3JhdmF0YXIuY29tL2F2YXRhci81ZGVhZDAxMjVkZmI5MTBkNmRmZGQ3OWM3NmY5OTI0Zj9zPTQ4MCZyPXBnJmQ9aHR0cHMlM0ElMkYlMkZjZG4uYXV0aDAuY29tJTJGYXZhdGFycyUyRnJvLnBuZyIsInVwZGF0ZWRfYXQiOiIyMDE5LTEwLTAxVDIyOjI3OjE3LjU1N1oiLCJlbWFpbCI6InJvY2NvNTZAZ21haWwuY29tIiwiZW1haWxfdmVyaWZpZWQiOmZhbHNlLCJpc3MiOiJodHRwczovL3RyYWNlbGFicy5hdXRoMC5jb20vIiwic3ViIjoiYXV0aDB8NWQ5MjlkNjgzMjg1NmQwYzU4ZTliYjg5IiwiYXVkIjoidXE5aHhBQzFVeGpKM3JKYlBucXlVb1hBMlhhYnowbDIiLCJpYXQiOjE1Njk5Njg4MzgsImV4cCI6MTU3MDAwNDgzOCwiYXRfaGFzaCI6ImxhX3VzZDhZemt1NFhSSUMtN2lqU1EiLCJub25jZSI6IlF-MVlORFJRcHdIRS4wTTJSeTA4TTF1Vm5peDl6ZXZUIn0.fhCfkRIRMAJFUgbT3IFRov3wkIDhkKjE8SXwWaO1u6UR1mCbXCV9fd9BwE24x2dz1rY6h0xcakNSdRBji4CANv4C7E4MIvAlWX38UfDWS634nUmi0hv9TCfjIHtE5zvVfSuN7_7Q8tpDIW9brSc_d46U-ZT2WId8iaLeBm0OXj2pXndSjn2HMWmhgVVq3lK2HF8pHpBzRbtXBiHwHbqX8m_KGmpzfdxe9IA8LaM5r0aPNAgApe_wRy5_yROtZU-1S--rwuQuBTwh2lnSPhxowqpo38nPHu2YEAk9_6zdzFCBJ_gVMl1slFEI6mPXdP30Vt9LkBK-fzSVmjrwknOXIQ
  plugins:
    faker: {}
  processor: './stress.js'
  variables:
    submission: >-
      mutation insertSubmission(
        $content: String!
        $explanation: String!
        $teamId: uuid!
        $eventId: uuid!
        $caseId: uuid!
        $configId: uuid!
        $supportingEvidence: String!
      ) {
        insert_submission(
          objects: {
            content: $content
            explanation: $explanation
            team_id: $teamId
            event_id: $eventId
            case_id: $caseId
            config_id: $configId
            supporting_evidence: $supportingEvidence
          }
        ) {
          affected_rows
        }
      }
    content: '$faker.internet.url'
    proof: '$faker.lorem.sentence'
    supportingEvidence: '$faker.lorem.sentence'
scenarios:
  - flow:
      - function: "generateRandomData"
      # - log: "New Virtual User: {{ url }}, {{ explanation }}, {{ category }}"
      - post:
          url: "/v1/graphql"
          json:
            query: "{{ submission }}"
            variables:
                content: "{{ content }}"
                explanation: "{{ proof }}"
                teamId: "d77b8b5c-f6aa-4560-b277-a8f110f389c9"
                eventId: "c68571a3-61dd-47b9-b170-29afa0aeb200"
                caseId: "66bf29df-0481-4ebd-ba3f-f83f1f52c03a"
                configId: "{{ category }}"
                supportingEvidence: "{{ supportingEvidence }}"
